# coding: utf8
loc = {
    'welcome'                 : 'Привет! Я умею работать с криптовалютами: выдавать курс, составлять портфель и следить за ним!\n - Нажми ПОМОЩЬ, чтобы узнать подробнее.\n - Жми ДЕМО-ДАННЫЕ, если хочешь скопировать готовый портфель.',

    'btn1_market'             : 'БИРЖА',
    'btn2_portf'              : 'МОЙ ПОРТФЕЛЬ',
    'btn3_demo'               : 'ДЕМО-ДАННЫЕ',
    'btn4_help'               : 'ПОМОЩЬ',

    'btn11_coininfo'          : 'Информация по криптовалюте',
    'btn12_cointrades'        : 'Сделки по криптовалюте',

    'btn21_showportf'         : 'Показать портфель',
    'btn22_showtrades'        : 'Показать все сделки',
    'btn23_addtrade'          : 'Добавить сделку',
    'btn24_deletetrade'       : 'Удалить сделку',
    'btn25_clearportf'        : 'Очистить портфель',

    'btn31_copyportf'         : 'Скопировать демо-портфель',

    'btn1_market_reply'       : 'Здесь можно посмотреть биржевую информацию о выбранной криптовалюте по данным Yobit.net',
    'btn2_portf_reply'        : 'Управление портфелем',
    'btn3_demo_reply'         : 'Выбери Скопировать демо-портфель, чтобы добавить демо сделки в свой портфель',

    'btn11_coininfo_reply'    : 'Введи тикер криптовалюты. Пример: BTC. Будет показана биржевая информация по отношению к USD',
    'btn12_cointrades_reply'  : 'Введи тикер криптовалюты. Пример: BTC. Будут показаны последние 10 сделок на бирже Yobit.', 
    'btn23_addtrade_reply'    : 'Чтобы добавить сделку в портфель, запиши через запятую: коин, тип, объем, сумму в USD, дату.\nПример: BTC, buy, 0.1, 6000, 2021-10-23 08:09:44',
    'btn24_deletetrade_reply' : 'Укажи номер сделки (только число) для удаления.',

    'btn4_help_reply'         : '<b>СПРАВКА</b>\
                                \nЯ работаю с биржей Yobit.net. Умею составлять для каждого пользователя отдельный портфель.\
                                \n\nВозможный сценарии демонстрации работы: \
                                \n  1) Перейти в БИРЖА, попробовать получить информацию о криптовалютах: BTC, LTC, ETH, DODGE и другие известные. \
                                \n  2) Перейти в ДЕМО-ДАННЫЕ -> Скопировать демо-портфель.\
                                \n  3) Перейти в МОЙ ПОРТФЕЛЬ, последовательно нажать на Показать все сделки, Показать портфель. В последнем случае отобразится график состава портфеля.\
                                \n  4) Тут же попробовать добавить свою сделку через одноименную команду; посмотреть, как изменился состав портфеля.\
                                \n  5) Далее можно попробовать Удалить сделку и Очистить портфель (восстановить всегда можно через Демо-данные).',


    'btn_back'                : '<< Назад',

    'select_command'          : 'Выбери необходимую команду',

    'complete'                : 'Готово.',
    'what_next'               : 'Чем еще могу помочь?',
    'unknown_coin'            : 'Неизвестная криптовалюта :( Пожалуйста, проверь ввод. Начни с выбора команды ниже',
    'unknown'                 : 'Неизвестная команда :( Пожалуйста, используй кнопки ниже.',
    'failed_command'          : 'Ошибка выполнения команды. Пожалуйста, проверь ввод. Начните с выбора команды ниже',
    'failed_dbquery'          : 'Ошибка выполнения запроса к БД',
    'portfolio_empty'         : 'Нет сделок или портфель пустой. Добавь новую сделку с помощью кнопки Добавить сделку'
}